_Rarzrabotki/zup_1/Reports/СпискиПерсональногоВоинскогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>СпискиПерсональногоВоинскогоУчета</Name>
			<Comment>Списки персонального воинского учета (Приложение 5)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьБыстрыйОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

_Rarzrabotki/zup_1/InformationRegisters/ПаспортныеДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанныеФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/zup_1/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/zup_1/Reports/СпискиПерсональногоВоинскогоУчета/Ext/ObjectModule.bsl
Перем СохраненнаяНастройка Экспорт;

#Если Клиент ИЛИ ВнешнееСоединение Тогда

Процедура СформироватьОтчет(ФормаОтчета) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.Настройки;
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;

	
    ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета"), ДатаОтчета); 
    ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаФормирования"), ДатаФормирования);
	Период = ?(ДатаОтчета > ДатаФормирования, ДатаОтчета, ДатаФормирования);
	
	ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"), Период);

	КомпоновщикМакета  = Новый КомпоновщикМакетаКомпоновкиДанных;

	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,Истина);
	
	ДокументРезультат = ФормаОтчета.ЭлементыФормы.Результат;
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Данные = Новый ДеревоЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(Данные);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ВывестиМакет(ДокументРезультат, Данные, ФормаОтчета)
		

КонецПроцедуры	

Процедура ВывестиМакет(ДокументРезультат, Данные, ФормаОтчета) Экспорт
	
	Макет = ПолучитьМакет("ПФ_СпискиПерсональногоВоинскогоУчета");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаФизическихЛиц = Новый ТаблицаЗначений;
	ТаблицаФизическихЛиц.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));

	ТаблицаУвольнений = Новый ТаблицаЗначений;
	ТаблицаУвольнений.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаУвольнений.Колонки.Добавить("ДатаУвольнения", Новый ОписаниеТипов("Дата"));
	
	Для Каждого ДанныеОрганизации Из Данные.Строки Цикл
		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл 
			НоваяСтрокаТаблицыСотрудников = ТаблицаФизическихЛиц.Добавить();
			НоваяСтрокаТаблицыСотрудников.ФизЛицо = ДанныеСотрудников.ФизЛицо;
		КонецЦикла;	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаФизическихЛиц", ТаблицаФизическихЛиц); 
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизическихЛиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	&ТаблицаФизическихЛиц КАК ТаблицаФизическихЛиц";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛицаОбразование.ВидОбразования КАК ВидОбразования,
	|	ФизическиеЛицаОбразование.Специальность КАК Специальность,
	|	ФизическиеЛицаОбразование.Диплом КАК Диплом,
	|   ФизическиеЛицаОбразование.Ссылка КАК Физлицо
	|ИЗ
	|	ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Образование КАК ФизическиеЛицаОбразование
	|	ПО ТаблицаОтборовФизическихЛиц.ФизЛицо = ФизическиеЛицаОбразование.Ссылка";
	ОбразованияФизическихЛиц = Запрос.Выполнить().Выбрать();  
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СемейноеПоложениеФизЛицСрезПоследних.Физлицо КАК ФизЛицо,     
	|	СемейноеПоложениеФизЛицСрезПоследних.СемейноеПоложение КАК СемейноеПоложение
	|ИЗ
	|	РегистрСведений.СемейноеПоложениеФизЛиц.СрезПоследних(
	|			&Период,
	|				 Физлицо В
	|					(ВЫБРАТЬ
	|						ТаблицаОтборовФизическихЛиц.Физлицо КАК Физлицо
	|					ИЗ
	|						ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц)) КАК СемейноеПоложениеФизЛицСрезПоследних";  
	СемейноеПоложениеФизЛиц = Запрос.Выполнить().Выбрать();
	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоставСемьи.Ссылка КАК ФизЛицо,
	               |	СоставСемьи.СтепеньРодства КАК СтепеньРодства,
	               |	СоставСемьи.ФизЛицо КАК Родственник,
	               |	ВЫБОР
	               |		КОГДА ФИОФизЛиц.Фамилия ЕСТЬ NULL
	               |			ТОГДА СоставСемьи.ФизЛицо.Наименование
	               |		ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество
	               |	КОНЕЦ КАК ФиоРодственника,
	               |	СоставСемьи.ФизЛицо.ДатаРождения КАК ДатаРожденияРодственника,
	               |	СоставСемьи.ГодРождения
	               |ИЗ
	               |	ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.СоставСемьи КАК СоставСемьи
	               |		ПО (СоставСемьи.Ссылка = ТаблицаОтборовФизическихЛиц.Физлицо)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Период, ) КАК ФИОФизЛиц
	               |		ПО (СоставСемьи.ФизЛицо = ФИОФизЛиц.ФизЛицо)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФизЛицо,
	               |	СоставСемьи.ГодРождения УБЫВ";
	РодственникиФизическихЛиц = Запрос.Выполнить().Выбрать();     
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК ФизЛицо,     
	|	ДокументыФизическихЛицСрезПоследних.ДокументВид КАК ДокументВид,
	|	ДокументыФизическихЛицСрезПоследних.ДокументСерия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.ДокументНомер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.ДокументКемВыдан КАК КемВыдан
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|			&Период,
	|				 Физлицо В
	|					(ВЫБРАТЬ
	|						ТаблицаОтборовФизическихЛиц.Физлицо КАК Физлицо
	|					ИЗ
	|						ВТФизическиеЛица КАК ТаблицаОтборовФизическихЛиц)) КАК ДокументыФизическихЛицСрезПоследних";  
	ДокументыФизическихЛиц = Запрос.Выполнить().Выбрать();
	
	
	Для Каждого ДанныеОрганизации Из Данные.Строки Цикл

		ОбластьЗаголовок.Параметры.ПолноеНаименованиеОрганизации = ДанныеОрганизации.Организация.НаименованиеПолное;
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		Для Каждого ДанныеСотрудников Из ДанныеОрганизации.Строки Цикл
			СтрокаТаблицы.Параметры.Заполнить(ДанныеСотрудников);
			
			НомерРегистратора = ОбщегоНазначения.ПолучитьНомерНаПечать(ДанныеСотрудников.Регистратор);
	    	ДатаРегистратора = Формат(ДанныеСотрудников.Регистратор.Дата,"ДФ='dd.MM.yyyy'");
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.КодПоДРФО) И ЗначениеЗаполнено(ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных) Тогда  
				СтрокаТаблицы.Параметры.НомерЗаписиВРеестреВоеннообязанных = ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных + "/" + ДанныеСотрудников.КодПоДРФО
			Иначе 
				СтрокаТаблицы.Параметры.НомерЗаписиВРеестреВоеннообязанных = ?(ЗначениеЗаполнено(ДанныеСотрудников.КодПоДРФО),ДанныеСотрудников.КодПоДРФО, ДанныеСотрудников.НомерЗаписиВРеестреВоеннообязанных ) 
			КонецЕсли;      
			
			ОтборПоУвольнению = Новый Структура;         
			ОтборПоУвольнению.Вставить("Сотрудник", ДанныеСотрудников.Сотрудник); 
			
			НомерРегистратораДоУвольнения = "";
			ДатаРегистратораДоУвольнения = "";
			РегистраторДоУвольнения = Неопределено;
			
			Если ЗначениеЗаполнено(ДанныеСотрудников.ДатаУвольнения) Тогда
				ЗаписиПередУвольнением = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ДанныеСотрудников.ДеньПередУвольнением, ОтборПоУвольнению);
				Если ЗаписиПередУвольнением <> Неопределено И ЗаписиПередУвольнением.Количество() > 0 Тогда
					РегистраторДоУвольнения = ЗаписиПередУвольнением[0].Регистратор;
					НомерРегистратораДоУвольнения = ОбщегоНазначения.ПолучитьНомерНаПечать(РегистраторДоУвольнения);
	    			ДатаРегистратораДоУвольнения = Формат(РегистраторДоУвольнения.Дата,"ДФ='dd.MM.yyyy'");
				КонецЕсли;	
			КонецЕсли;	
			
			Если НЕ РегистраторДоУвольнения = Неопределено Тогда    
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + НомерРегистратораДоУвольнения + " від " + ДатаРегистратораДоУвольнения + "/" + Символы.ПС + Символы.ПС +
				"Наказ про звільнення № " + НомерРегистратора + " від " + ДатаРегистратора;
			Иначе	
				СтрокаТаблицы.Параметры.РеквизитыРегистратора = "Наказ № " + НомерРегистратора + " від " + ДатаРегистратора;
			КонецЕсли; 
			
			Отбор = Новый Структура;         
			Отбор.Вставить("ФизЛицо", ДанныеСотрудников.ФизЛицо); 
			
   		    ТекстСоставСемьи = ""; 
			ТекстОбразование = "";  
			ТекстДокументы = "";
			
			СемейноеПоложениеФизЛиц.Сбросить(); 
			Если СемейноеПоложениеФизЛиц.НайтиСледующий(Отбор, "ФизЛицо") Тогда
				ТекстСоставСемьи = Строка(СемейноеПоложениеФизЛиц.СемейноеПоложение)
			КонецЕсли;
			
			РодственникиФизическихЛиц.Сбросить();
			Пока РодственникиФизическихЛиц.НайтиСледующий(Отбор, "ФизЛицо") Цикл 
				ГодРожденияРодственника = "";
				Если ЗначениеЗаполнено(РодственникиФизическихЛиц.ГодРождения) Или ЗначениеЗаполнено(РодственникиФизическихЛиц.ДатаРожденияРодственника) Тогда
					ГодРожденияРодственника = ?(ЗначениеЗаполнено(РодственникиФизическихЛиц.ГодРождения), Строка(РодственникиФизическихЛиц.ГодРождения),Год(РодственникиФизическихЛиц.ДатаРожденияРодственника));
            		ТекстСоставСемьи = ТекстСоставСемьи + Символы.ПС + Символы.ПС +  РодственникиФизическихЛиц.ФИОРодственника + ?(ЗначениеЗаполнено(ГодРожденияРодственника),", ","") 
					+ ГодРожденияРодственника; 
				Иначе
					ТекстСоставСемьи = ТекстСоставСемьи + Символы.ПС + Символы.ПС +  РодственникиФизическихЛиц.ФИОРодственника
				КонецЕсли	
			КонецЦикла;          
			СтрокаТаблицы.Параметры.ТекстСоставСемьи = ТекстСоставСемьи;     
			
			ОбразованияФизическихЛиц.Сбросить();
			Пока ОбразованияФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо") Цикл                  
				ТекстДокумент = "";
				ТекстДокумент = ОбразованияФизическихЛиц.Диплом;
				Если ТекстОбразование = "" Тогда
        			ТекстОбразование = ТекстОбразование + Строка(ОбразованияФизическихЛиц.ВидОбразования) +  
					?(ЗначениеЗаполнено(ОбразованияФизическихЛиц.Специальность), ", ", "") + ОбразованияФизическихЛиц.Специальность + ?(СокрЛП(ТекстДокумент) = "","", ", ") +
					ТекстДокумент;
				Иначе	
            		ТекстОбразование = ТекстОбразование + Символы.ПС + Символы.ПС + Строка(ОбразованияФизическихЛиц.ВидОбразования) +  
					?(ЗначениеЗаполнено(ОбразованияФизическихЛиц.Специальность), ", ", "") + ОбразованияФизическихЛиц.Специальность + ?(СокрЛП(ТекстДокумент) = "","", ", ") +
					ТекстДокумент;
				КонецЕсли	
			КонецЦикла;    
			СтрокаТаблицы.Параметры.ТекстОбразование = ТекстОбразование; 
			
			ДокументыФизическихЛиц.Сбросить(); 
			Если ДокументыФизическихЛиц.НайтиСледующий(Отбор, "ФизическоеЛицо") Тогда 
				ТекстДокументы = Строка(ДокументыФизическихЛиц.ДокументВид) + " " + ДокументыФизическихЛиц.Серия + " " + ДокументыФизическихЛиц.Номер +
				?(СокрЛП(ДокументыФизическихЛиц.КемВыдан) = "", "", ", ") + ДокументыФизическихЛиц.КемВыдан + ?(СокрЛП(ДокументыФизическихЛиц.ДатаВыдачи) = "", "", ", ") +
				Формат(ДокументыФизическихЛиц.ДатаВыдачи,"ДФ=dd.MM.yyyy");
			КонецЕсли;	
			
			СтрокаТаблицы.Параметры.ТекстДокументы = ТекстДокументы; 
			ДокументРезультат.Вывести(СтрокаТаблицы);
		КонецЦикла;
		
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
КонецПроцедуры	

#КонецЕсли

#Если Клиент Тогда
	
// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	ТиповыеОтчеты.ИнициализацияТиповогоОтчета(ЭтотОбъект);
	
КонецПроцедуры

#КонецЕсли
